rcarmo/cydintosh/sdkconfig.defaults.esp32p4.bootdiag
# ESP32-P4 / M5Stack Tab5 minimal boot diagnostic configuration
CONFIG_IDF_TARGET="esp32p4"

# Connected Tab5 reports 16MB flash via ESP32-P4 USB-Serial/JTAG.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
# Match the official M5Tab5-UserDemo reference configuration.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# Keep this diagnostic intentionally before PSRAM bring-up. If this build shows
# GPIO22 activity but the LC build does not, the blocker is in boot-time PSRAM
# initialization or later LC diagnostics, not flashing/app selection.
# CONFIG_SPIRAM is not set

CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Keep task watchdog permissive during early hardware bring-up.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# Console via USB-Serial/JTAG on the Tab5.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=y

# Wi-Fi/Bluetooth are not present on ESP32-P4; keep network stacks out of the LC target.
# CONFIG_ESP_WIFI_ENABLED is not set
# CONFIG_BT_ENABLED is not set


# Connected Tab5 reports ESP32-P4 rev v1.3. ESP-IDF 5.5 defaults target rev
# >=3.x for generic P4 configs, which can produce a bootloader that traps with
# Illegal instruction on this board. Match the rev-v1.x path used to make the
# official M5Tab5-UserDemo run on this hardware.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP32P4_REV_MIN_FULL=100
CONFIG_ESP_REV_MIN_FULL=100
CONFIG_ESP32P4_REV_MAX_FULL=199
CONFIG_ESP_REV_MAX_FULL=199
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=360
